Revit 2027 API
BuiltInFailures.ElectricityFailures Class
 Failures related to electrical system and circuits.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ElectricityFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ElectricityFailures
Public NotInheritable Class ElectricityFailures
public ref class ElectricityFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ElectricityFailures = class end
The BuiltInFailures.ElectricityFailures type exposes the following members.
Properties
Name | Description
FamilyMismatchCircuitDisconnected |  The family no longer matches the properties for the Circuit. Disconnect the family from the Circuit?
InvalidPoleNumber |  The panel is single phase [wire] wires. The number of poles can not be larger than [value].
InvalidPoleNumberInIsolatedPanel |  The panel is an isolated panel. The number of poles should equal to [value].
InvalidSpareLoad |  The spare/space assigned to panel '[Panel Name]' has an invalid load property. To correct this issue, remove and add the spare/space to the panel again.
Top
See Also
Reference
Autodesk.Revit.DB Namespace